IDEA StatiCa Open Model
RebarBase.RebarAllocationElement Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 the element where this rebar belongs (part of that beam)
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ReferenceElement RebarAllocationElement { get; set; }
Public Property RebarAllocationElement As ReferenceElement
	Get
	Set
public:
property ReferenceElement^ RebarAllocationElement {
	ReferenceElement^ get ();
	void set (ReferenceElement^ value);
}
Property Value
Type: ReferenceElement
See Also
Reference
RebarBase Class
IdeaRS.OpenModel.Model Namespace